RTX93/LVGL_SSD1963_STM32F207ZG/Drivers/SSD1963_DRV/SSD1963.h
/*****************************************************************************
 *  Module for Microchip Graphics Library
 *  Solomon Systech. SSD1963 LCD controller driver
 *****************************************************************************
 * FileName:        SSD1963.h
 * Dependencies:    p24Fxxxx.h or plib.h
 * Processor:       PIC24, PIC32
 * Compiler:       	MPLAB C30, MPLAB C32
 * Linker:          MPLAB LINK30, MPLAB LINK32
 * Company:			TechToys Company
 * Remarks:			The origin of this file was the ssd1926.c driver released
 *					by Microchip Technology Incorporated.
 *
 * Company:         Microchip Technology Incorporated
 *
 * Software License Agreement
 *
 * Copyright ?2008 Microchip Technology Inc.  All rights reserved.
 * Microchip licenses to you the right to use, modify, copy and distribute
 * Software only when embedded on a Microchip microcontroller or digital
 * signal controller, which is integrated into your product or third party
 * product (pursuant to the sublicense terms in the accompanying license
 * agreement).
 *
 * You should refer to the license agreement accompanying this Software
 * for additional information regarding your rights and obligations.
 *
 * SOFTWARE AND DOCUMENTATION ARE PROVIDED ï¿½AS IS?WITHOUT WARRANTY OF ANY
 * KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY
 * OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR
 * PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR
 * OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION,
 * BREACH OF WARRANTY, OR OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT
 * DAMAGES OR EXPENSES INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL,
 * INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA,
 * COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY
 * CLAIMS BY THIRD PARTIES (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF),
 * OR OTHER SIMILAR COSTS.
 *
 * Author               Date        Comment
 *~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * Anton Alkhimenok     08/27/08
 *****************************************************************************/

/*
******************************************************************************
* Versions 120709
*
* John Leung @ TechToys Co.			12/07/09
* www.TechToys.com.hk
******************************************************************************
*/

/*
******************************************************************************
* Remarks:
* 1. Removed hardware definition for LED_LAT_BIT and LED_TRIS_BIT
*	  because PWM pin of SSD1963 applied, therefore backlight intensity
*	  set by software
* 2. Add new function void SetBacklight(BYTE intensity)
* 3. Funny finding, PLL to 120MHz work only when 10MHz crystal applied with
* 	  multiplier N = 35. A crystal with 4MHz attempted but the PLL frequency
*	  failed to boost to 120MHz somehow!
*
* John Leung @ TechToys Co.			09/09/2009
* www.TechToys.com.hk
******************************************************************************
*/

/*
******************************************************************************
* Remarks:
* Port ot Microchip Graphics Library v2.00
* (1) Only BLOCKING CONFIGURATION is supported
* (2) GetPixel() not working yet.
* John Leung @ TechToys Co.			15th Jan 2010
* www.TechToys.com.hk
******************************************************************************
*/

#ifndef _SSD1963_H
#define _SSD1963_H

#include "main.h"
#include "stm32f2xx.h"
#include "../SSD1963_DRV/SSD1963_CMD.h"


/*
*****************************************************************************
		DISPLAY ~ FSMC ~ Configuration
*****************************************************************************
*/

#define TFT_LCD_REG	 *(__IO uint8_t *)(0x60000000)
#define TFT_LCD_RAM	 *(__IO uint8_t *)(0x60010000)

/*
*****************************************************************************
		DISPLAY ~ RES ~ Configuration
*****************************************************************************
*/


#define DISP_HOR_RESOLUTION 320
#define DISP_VER_RESOLUTION 240

#define COLOR_DEPTH 32

/*
*****************************************************************************
		FON ~ Configuration
*****************************************************************************
*/

//#define  ARIAL19x19
//#define  TIMES_NEW_ROMAN18x18
//#define  CALIBRI16X17
//#define  SMALL_FONTS9X9
#define SMALL_FONTS9X9_WITH_SYMBOL
//#define    SMALL_FONTS8X9
//#define  SMALL_FONTS7X6


/*
*****************************************************************************
		STM32F030RCT6 ~ Porting Interface
*****************************************************************************
*/

//LCD_DC  ~ Data/Command select
#define IC_A0_SET		HAL_GPIO_WritePin(GPIOD,LCD_DC_RS_Pin,GPIO_PIN_SET);
#define IC_A0_RESET		HAL_GPIO_WritePin(GPIOD,LCD_DC_RS_Pin,GPIO_PIN_RESET);


//LCD_WR
#define IC_WR_SET		HAL_GPIO_WritePin(GPIOD,LCD_WR_Pin,GPIO_PIN_SET);
#define IC_WR_RESET		HAL_GPIO_WritePin(GPIOD,LCD_WR_Pin,GPIO_PIN_RESET);

//LCD_RD
#define IC_RD_SET		HAL_GPIO_WritePin(GPIOD,LCD_RD_Pin,GPIO_PIN_SET);
#define IC_RD_RESET		HAL_GPIO_WritePin(GPIOD,LCD_RD_Pin,GPIO_PIN_RESET);

//LCD_CS#
#define IC_CS_SET		HAL_GPIO_WritePin(GPIOD,LCD_CS_Pin,GPIO_PIN_SET);
#define IC_CS_RESET		HAL_GPIO_WritePin(GPIOD,LCD_CS_Pin,GPIO_PIN_RESET);

//LCD_RST#
#define IC_RST_SET		HAL_GPIO_WritePin(GPIOF,LCD_RST_Pin,GPIO_PIN_SET);
#define IC_RST_RESET	HAL_GPIO_WritePin(GPIOF,LCD_RST_Pin,GPIO_PIN_RESET);

#if 0//For FSMC not required

//Data Bus
#define DATA_BUS(__X__)   		   HAL_GPIO_WritePin(GPIOB,LCD_DB0_Pin,((__X__ & (1<<0))));\
										HAL_GPIO_WritePin(GPIOB,LCD_DB1_Pin,((__X__ & (1<<1))));\
										HAL_GPIO_WritePin(GPIOB,LCD_DB2_Pin, ((__X__ & (1<<2))));\
										HAL_GPIO_WritePin(GPIOB,LCD_DB3_Pin, ((__X__ & (1<<3))));\
										HAL_GPIO_WritePin(GPIOB,LCD_DB4_Pin, ((__X__ & (1<<4))));\
										HAL_GPIO_WritePin(GPIOB,LCD_DB5_Pin, ((__X__ & (1<<5))));\
										HAL_GPIO_WritePin(GPIOB,LCD_DB6_Pin, ((__X__ & (1<<6))));\
										HAL_GPIO_WritePin(GPIOA,LCD_DB7_Pin, ((__X__ & (1<<7))));
#endif

void SSD1963_Write_Data (unsigned char data);
void SSD1963_Write_Command (unsigned char command);
/*
#ifndef DISP_HOR_RESOLUTION
#error  DISP_HOR_RESOLUTION must be defined in HardwareProfile_xxx.h
#endif

#ifndef DISP_VER_RESOLUTION
#error  DISP_VER_RESOLUTION must be defined in HardwareProfile_xxx.h
#endif

#ifndef COLOR_DEPTH
#error  COLOR_DEPTH must be defined in HardwareProfile_xxx.h
#endif

#ifndef DISP_ORIENTATION
#error  DISP_ORIENTATION must be defined in HardwareProfile_xxx.h
#endif
*/
/*********************************************************************
* Overview: Horizontal synchronization timing in pixels
*                  (from the glass datasheet).
*********************************************************************/
/*
#ifndef DISP_HOR_PULSE_WIDTH
#error  DISP_HOR_PULSE_WIDTH must be defined in HardwareProfile_xxx.h
#endif
#ifndef DISP_HOR_BACK_PORCH
#error  DISP_HOR_BACK_PORCH must be defined in HardwareProfile_xxx.h
#endif
#ifndef DISP_HOR_FRONT_PORCH
#error  DISP_HOR_FRONT_PORCH must be defined in HardwareProfile_xxx.h
#endif
*/

/*********************************************************************
* Overview: Vertical synchronization timing in lines
*                  (from the glass datasheet).
*********************************************************************/
/*
#ifndef DISP_VER_PULSE_WIDTH
#error  DISP_VER_PULSE_WIDTH must be defined in HardwareProfile_xxx.h
#endif
#ifndef DISP_VER_BACK_PORCH
#error  DISP_VER_BACK_PORCH must be defined in HardwareProfile_xxx.h
#endif
#ifndef DISP_VER_FRONT_PORCH
#error  DISP_VER_FRONT_PORCH must be defined in HardwareProfile_xxx.h
#endif
*/

/*********************************************************************
* PARAMETERS VALIDATION
*********************************************************************/
#if COLOR_DEPTH != 16
//#error This driver supports 16 BPP only.
#endif

