RTX93/LVGL_SSD1963_STM32F207ZG/Drivers/SSD1963_DRV/SSD1963.h
#if (DISP_HOR_RESOLUTION % 8) != 0
//#error Horizontal resolution must be divisible by 8.
#endif

#if (DISP_ORIENTATION != 0) && (DISP_ORIENTATION != 180) && (DISP_ORIENTATION != 90) && (DISP_ORIENTATION != 270)
//#error The display orientation selected is not supported. It can be only 0,90,180 or 270.
#endif

/*********************************************************************
* Overview: Clipping region control codes to be used with SetClip(...)
*           function.
*********************************************************************/
#define CLIP_DISABLE       0 	// Disables clipping.
#define CLIP_ENABLE        1	// Enables clipping.


/*********************************************************************
 * Typedef - porting patch //SURESH
 * *******************************************************************/
typedef int8_t s8;
typedef int16_t s16;
typedef int32_t s32;

typedef uint8_t u8;
typedef uint16_t u16;
typedef uint32_t u32;
typedef volatile uint32_t vu32;
//typedef uint8_t bool;


#define TRUE	1
#define FALSE	0
/*********************************************************************
* Macros: RGB565CONVERT(red, green, blue)
*
* Overview: Converts true color into 5:6:5 RGB format.
*
* PreCondition: none
*
* Input: Red, Green, Blue components.
*
* Output: 5 bits red, 6 bits green, 5 bits blue color.
*
* Side Effects: none
*
********************************************************************/
    #define RGB565CONVERT(red, green, blue) (u16) (((red >> 3) << 11) | ((green >> 2) << 5) | (blue >> 3))


/*********************************************************************
* Overview: Some basic colors definitions.
*********************************************************************/
#define BLACK_565               RGB565CONVERT(0,    0,      0)
#define BRIGHTBLUE_565          RGB565CONVERT(0,    0,      255)
#define BRIGHTMAGENTA_565       RGB565CONVERT(255,  0,      255)
#define RED_565                 RGB565CONVERT(128,  0,      0)


#if 0
#define BLACK               RGB565CONVERT(0,    0,      0)
#define BRIGHTBLUE          RGB565CONVERT(0,    0,      255)
#define BRIGHTGREEN         RGB565CONVERT(0,    255,    0)
#define BRIGHTCYAN          RGB565CONVERT(0,    255,    255)
#define BRIGHTRED           RGB565CONVERT(255,  0,      0)
#define BRIGHTMAGENTA       RGB565CONVERT(255,  0,      255)
#define BRIGHTYELLOW        RGB565CONVERT(255,  255,    0)
#define BLUE                RGB565CONVERT(0,    0,      128)
#define GREEN               RGB565CONVERT(0,    128,    0)
#define CYAN                RGB565CONVERT(0,    128,    128)
#define RED                 RGB565CONVERT(128,  0,      0)
#define MAGENTA             RGB565CONVERT(128,  0,      128)
#define BROWN               RGB565CONVERT(255,  128,    0)
#define LIGHTGRAY           RGB565CONVERT(128,  128,    128)
#define DARKGRAY            RGB565CONVERT(64,   64,     64)
#define LIGHTBLUE           RGB565CONVERT(128,  128,    255)
#define LIGHTGREEN          RGB565CONVERT(128,  255,    128)
#define LIGHTCYAN           RGB565CONVERT(128,  255,    255)
#define LIGHTRED            RGB565CONVERT(255,  128,    128)
#define LIGHTMAGENTA        RGB565CONVERT(255,  128,    255)
#define YELLOW              RGB565CONVERT(255,  255,    128)
#define WHITE               RGB565CONVERT(255,  255,    255)

#define GRAY0       	    RGB565CONVERT(224,  224,    224)
#define GRAY1         	    RGB565CONVERT(192,  192,    192)
#define GRAY2               RGB565CONVERT(160,  160,    160)
#define GRAY3               RGB565CONVERT(128,  128,    128)
#define GRAY4               RGB565CONVERT(96,   96,     96)
#define GRAY5               RGB565CONVERT(64,   64,     64)
#define GRAY6	            RGB565CONVERT(32,   32,     32)
#endif

//RGB888 Format


#define BLACK	0x000000
#define WHITE	0xFFFFFF
#define RED		0xFF0000
#define GREEN	0x00FF00
#define BLUE	0x0000FF
#define GRAY3	0x808080
#define CYAN	0x00FFFF
#define MAGENTA	0xFF00FF
#define YELLOW	0xFFFF80

#define VIOLET	0xFF82FF
#define INDIGO  0x82004B

#define LIGHTBLUE           0x8080FF
#define LIGHTGREEN          0x80FF80
#define LIGHTCYAN           0x80FFFF
#define LIGHTRED            0xFF8080
#define LIGHTMAGENTA        0xFF80FF

#define DARKGREEN           0x006400
#define NAVYBLUE            0x000080

//GLCD Font Write API
void GLCD_ConfigAndWriteTextApi(uint16_t x, uint16_t y, char *str );
void SetFontColor(uint32_t ui32Color,uint32_t ui32BckColor);

uint32_t GetFontColor(uint8_t ui8BckOrFront);

/*********************************************************************
* Overview: Clipping region control and border settings.
*********************************************************************/
// Clipping region enable control
extern u16 _clipRgn;

// Left clipping region border
extern u16 _clipLeft;
// Top clipping region border
extern u16 _clipTop;
// Right clipping region border
extern u16 _clipRight;
// Bottom clipping region border
extern u16 _clipBottom;


// Active and Visual Pages
extern u8 _activePage;
extern u8	_visualPage;


/*********************************************************************
* Macros:  LCD_WriteCommand(cmd)
*
* PreCondition:
*
* Input: cmd - controller command
*
* Output: none
*
* Side Effects: none
*
* Overview: writes command
*
* Note: none
********************************************************************/
#define LCD_WriteCommand(cmd)							SSD1963_Write_Command(cmd);

/*********************************************************************
* Function:  void  LCD_WriteData(WORD data)
*
* PreCondition:
*
* Input:  value - value to be written in WORD format
*
* Output: none
*
* Side Effects: none
*
* Overview:
********************************************************************/

#define LCD_WriteData(data) 		SSD1963_Write_Data(data);

/*********************************************************************
* Function:  void ResetDevice()
*
* Overview: Initializes LCD module.
*
* PreCondition: none
*
* Input: none
*
* Output: none
*
* Side Effects: none
*
********************************************************************/
void LCD_ResetDevice(void);

/*********************************************************************
* Macros:  GetMaxX()
*
* Overview: Returns maximum horizontal coordinate for visual display
*
* PreCondition: none
*
* Input: none
*
* Output: Maximum horizontal coordinates.
*
* Side Effects: none
*
* Note:
********************************************************************/
#if (DISP_ORIENTATION == 90) || (DISP_ORIENTATION == 270)

#define	GetMaxX() 			(DISP_VER_RESOLUTION-1)


